[
  "At age two, Jose Rizal could already write and read. He wrote his first poem at the age of 8 entitled ‘Sa Aking Mga Kababata’ (To My Fellow Youth).",
  "Just like other Filipinos who are eagerly trying their luck to win the lottery, Rizal also joined such type of gambling where he won one-third of the grand prize (Php 18,000.00) with ticket number 9736. He gave a portion to his father, a friend in Hong Kong and he spent the rest buying agricultural lands in Talisay.",
  "He mastered 22 languages: Hebrew, Filipino, Ilokano, Bisayan, Subanon, Chinese, Latin, Spanish, Greek, English, French, German, Arabic, Malay, Sanskrit, Dutch, Japanese, Catalan, Italian, Portugese, Swedish and Russian.",
  "Rizal was too small for his age and made him a target of Pedro’s bullying, insulting Pepe in front of the other students at the school of Maestro Justiniano Cruz. Equipped with his Uncle Miguel’s teachings about the art of wrestling, Rizal challenged Pedro to a fistfight. Rizal won and became popular as he proved himself a worthy opponent.",
  "Rizal could show too much sarcasm because of his love for his country. Why and how? Back in Dapitan when he received three visitors in his house in Talisay, he offered the woman named Donya Manuela with Bagoong. The lady ignored the bagoong saying that they do not eat bagoong in their country because it contains worms. With that, Rizal responded saying that he had been in her country and people there eat little birds without taking out intestines.",
  "During his exile in Dapitan, he was able to establish a school where he had 21 pupils who were never asked to pay for tuition but was required by Rizal to work for the community. During the class discussion, when his students couldn’t answer his questions correctly, he would jokingly pinch his students.",
  "Rizal is one of the few recognized ‘Renaissance man’ in the world. A Renaissance man is a well-educated person and one who excels in a wide variety of subjects or fields. He was an anthropologist, ethnologist, economist, sociologist, educator, architect, engineer, sculptor, painter, playwright, novelist, historian, journalist, farmer, dramatist, ophthalmologist, martial artist, and a cartographer, among other things.",
  "Three animal species were named after Rizal; Draco Rizali, a species of flying dragon, Rachophorous Rizali, a species of toad and Apogonia Rizali, a beetle species.",
  "Jose Rizal graduated in Ateneo Municipal de Manila as one of the nine students in his class declared as ‘sobresaliente’ or ‘outstanding’. However, he didn’t really top his class when he was in high school. They were 10 in class and only 2 of them got low grades. So basically, the rest earned the same grade Rizal did.",
  "Considering that he lived during the latter part of the 19th century where the only means of long distance travel is by ship, he can be considered a very well traveled man. He traveled extensively and had been to the United States, Spain, Great Britain, France, Austria, Germany, Belgium, Switzerland, Czech Republic, Italy, Singapore, Borneo, Hong Kong, China and Japan. Not even a millionaire today could afford the numerous and extensive travels of Jose Rizal during his time.",
  "Rizal’s most famous quotation: ‘Ang hindi magmahal sa sariling wika, daig pa ang hayop at malansang isda’. (He who does not love his own language is worse than an animal and smelly fish).",
  "Monuments in honor of Jose Rizal were not only erected in the Philippines but also in various parts of the world like Madrid, Spain; Wilhelmsfeld, Germany; Jinjiang, Fujian, China; Chicago, Cherry Hill Township, San Diego, Seattle, U.S.A.; Mexico City, Mexico; Lima, Peru; Litomerice, Czech Republic; and Toronto, Ontario, Canada.",
  "Did you know that Rizal was addressed by his European lover as the ‘little bad boy’? Filipinos are truly honest with themselves saying Rizal was not that handsome – and given the fact he was a man of medium height and small built. However, Jose Rizal had his way with women – it might be his humor, knowledge or the way he present himself. On the series of letters that were discovered to be love messages for Rizal, a Belgian woman named Suzanne wrote: ‘There will never be any home in which you are so loved as that in Brussels. So, you little bad boy, hurry back.’",
  "(Partly related with Fact #13) There are rumors that Rizal was a playboy having a lot of girls mentioned in his autobiography and until now many believe that he really had a lot of girlfriends but the truth is that he only had few real relationships. The other girls were all just flings. and some were just plain friends.",
  "His poem Mi Retiro (My Retreat) was written when he was sick and could not work.",
  "A religious sect named the Rizalista – members of Cruzado, claims that Jose Rizal is the reincarnation of Jesus Christ. They believe that the execution in Bagumbayan was just a phase that he had to endure to be in the presence of God. They also believe that Rizal is still alive and lives deep in the forest of Mount Makiling.",
  "There are rumors that Rizal’s book entitled El FIlibusterismo was inspired by Alexandre Dumas’ novel The Count of Monte Cristo considering that it was actually one of Rizal’s favorite stories.",
  "Quite unusual for a man about to be executed, but his pulse proved to be normal when the Spanish surgeon general requested to take his pulse moments before Rizal’s execution. Rizal was indeed ready and unafraid of his fate.",
  "Because of his famed reputation as a Casanova, it was believed that he was involved with a beautiful woman living somewhere in the border of Germany and Austria making people spread statements that Adolf Hitler of Germany and Mao Zedong of China were sons of Jose Rizal.",
  "The dam he built in Dapitan was built using burned shells and bricks that were made from the machine he built. In his letter to his best friend, he said that the dam was built by him and fourteen young boys (his students).",
  "Filipinos believe that the reason why Rizal was really intelligent is because he was born with a big head.",
  "Ambeth R. Ocampo, a multi-awarded Filipino historian, got a hold of Rizal’s original writings which revealed Rizal’s markings and side notes of male organ of different sizes that were drawn all over the book.",
  "Rizal was never really a licensed doctor. He never graduated medicine. Technically, he couldn’t really be called Doctor.",
  "Rizal was never really a dentist. He just did some self-studying and ‘pretended’ to be one.",
  "Rizal’s allowance when he lived in Madrid was Php50 a month. When the family’s Laguna farm wasn’t doing good, he was given only Php35 for his monthly expenses.",
  "Rizal played the lottery and once won a third of the Php18,000 grand prize. He gave a portion each to his father and a Hong Kong-based friend. The rest of the money was used to buy agricultural lands in Talisay.",
  "Rizal’s last words before he was executed were “consummatum est”, which means “It is finished”.",
  "A lot of Filipinos do not know that Jose Rizal created humorous drawings while he was living in Germany. For this, he is considered as the “Father of Philippine Comics”.",
  "Rizal is one of the few recognized “Renaissance man” in the world. A Renaissance man is a well educated person and one who excels in a wide variety of subjects or fields",
  "Dapitan, where Rizal was put into exile, is in the province of Zamboanga in Mindanao and not in Sampaloc, Manila.",
  "He was executed on December 30, 1896, by a squad of Filipino soldiers of the Spanish Army.",
  "Just recently, popular video game TEKKEN named one of its fighter characters as Josie Rizal as tribute to Jose Rizal.",
  "The José Rizal Bridge and Rizal Park in the city of Seattle are dedicated to Rizal.",
  "At least ten towns / cities in Philippines are named \"Rizal\" (for example : Rizal - Cagayan)",
  "Nearly every town and city in Philippines contains a street named after Rizal (Rizal street and Rizal avenue)"
]
